org/进程调度算法.org
#+SETUPFILE: ../theme-rose.setup
#+DATE: <2021-03-17 三>
#+TITLE: 进程调度算法

#+begin_quote
本篇文章解释各种操作系统的进程调度算法，大部分是用于总结操作系统自考的算法。
#+end_quote

* 先来先服务算法
  洋文 First-Come First-Served
  洋文简称 FCFS
  + 优点
    便于理解，实现简单。
  + 原理
    非抢占式。以一种单向链表的方式进行进程调度，当第一个进程进入可以直接运行，当第二个进入时，若第一个没有运行完会将第二个进程放置队尾，等待第一个进程运行完毕后立刻运行。任意进程在运行时遇到阻塞时其原本还是就绪状态时的后一个进程会立刻进入运行状态，当等待事件处理完毕，重新激活后也只是重新放置到就绪队列队尾。
  + 缺点
    当遇到需要处理长进程时，其后面的短进程的周转时间会大大增加。
* 最短进程优先算法
  
* 最短剩余时间优先算法
* 最高响应比优先算法 
* 轮转算法           
* 最高优先级算法     
* 多级反馈队列算法   
